{
  "1.1.2": "Initial Release to Public",
  "1.1.3": "* Improvements\n   * Updated README for links to releases.\n   * Included Snyk Scanning\n   * Now supports Environment variables for authentication\n* New Knowledge Objects\n    * Supports CriblSearch knowledge objects",
  "1.1.4": "* Security Updates\n  * Updated `urllib3` to v2.2.2 to address [CVE-2024-37891](https://www.cve.org/CVERecord?id=CVE-2024-37891)\n  * Updated `setuptools` to `>=70.0.0`\n* Bugs\n  * Fixed `packs` export, configuration of the pack is now exported into the export config file.\n  * Fixed group targeting in source and destination.\n* Improvements\n  * Across the board, reworked internal command switches to be more consistent.\n* New Feature\n  * When uploading packs, the option to include a custom \"pack\" called a \"ruck\" is available.\n    * \"kits\" allow a more-comprehensive approach to packs, as they can include `collectors`, `inputs`, `secrets` and a default route that funnels matching data to the pack.\n    * The pack itself will still only contain pack routes, pipelines, and other knowledge settings, but other objects will be created if defined.\n  * Added configuration option `is_free` for standalone or not Enterprise editions of Cribl.\n  * Added `create` command for future use.\n  * Restrict to specific sources/destinations using `namespaces`.\n* Export\n  * Ability to export a lookup file (CSV) of Cribl Ids and Display names for further enrichments.\n  * Added ability to \"split\" configs into their knowledge objects with group and namespace information.\n* Validate\n  * Added multiple API Specs\n  * Still not working as intended due to malformed OpenAPI spec parsing.\n* Knowledge Objects\n  * `routes`\n    * Fixed the update call to \"substitute and replace\" only configured routes. Will not overwrite entire route list.",
  "1.1.5": "* API Spec Updates\n    * Added `4.10.1` API Specification\n    * Added `4.11.0`, `4.11.1` API Specification\n    * Added `4.12.0`, `4.12.2` API Specification\n    * Fixed bad Regex in API Specification to perform input validation.\n        * See README.md in `geese/constants/api_specs`\n* New Features\n  * **Environment Variables in Config**\n    * In `config.yaml`, or a user defined configuration file, each root level item (`username`, `password`, etc) can now include an environment variable.\n    * The key is variable as the environment requires.\n    * The variable must have a double `$$`\n    * Example is below, where the key will be replaced according to the regex `$$\\S+`.\n    ```yaml\n    destination:\n      username: $CRIBL_LEADER_USERNAME\n      password: $CRIBL_LEADER_PASSWORD\n    ```\n* Improvements\n  * Export `ALL`\n    * When working with geese, if a config source does not have the `worker_groups` configuration item, Cribl will be queried to determine available groups, and the entire set will be utilized for exporting.\n    * Destinations without a `worker_groups` configuration item will default to the single group `default`. ",
  "1.1.6": ""
}